app/controllers/cargos_controller.rb

  def index
    @cargos = Cargo.all
---
SELECT "cargos".* FROM "cargos"

  def show
    @cargo = Cargo.find(params[:id])
---
SELECT "cargos".* FROM "cargos" WHERE "cargos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def create
    extended_params = Package::Builder.cargo_information(cargo_params)
    @cargo = Cargo.new(extended_params)

    if @cargo.save
---
INSERT INTO "cargos" ("name", "surname", "middle_name", "phone", "email", "weight", "length", "width", "height", "origins", "destinations", "distance", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"