app/controllers/cargos_controller.rb

  def index
    @cargos = if params[:sort].present?
                current_user.cargos.order("#{params[:sort]} #{params[:direction]}").page(params[:page])
---
SELECT "cargos".* FROM "cargos" LIMIT $1  [["LIMIT", 11]]